In [2]:
import pandas as pd
import os
import numpy as np

In [3]:
data_dir = os.getcwd() + "/data"
print(data_dir)

# df = pd.DataFrame()

df = pd.read_excel(data_dir + "/gapminder_full.xlsx")
df  # reads sheet1 by default

/home/vik/Documents/pgdm/sem2/finance-py/data

     index      country  year  population  life exp     gdp_cap
0     1001  Afghanistan  1952   8425333.0    28.801  779.445314
1     1002  Afghanistan  1957   9240934.0       NaN  820.853030
2     1003  Afghanistan  1962  10267083.0    31.997  853.100710
3     1004  Afghanistan  1967  11537966.0    34.020  836.197138
4     1005  Afghanistan  1972  13079460.0    36.088  739.981106
..     ...          ...   ...         ...       ...         ...
558   1559       Gambia  1982    715523.0    45.580  835.809611
559   1560       Gambia  1987    848406.0    49.265  611.658861
560   1561       Gambia  1992   1025384.0    52.644  665.624413
561   1562       Gambia  1997   1235767.0    55.861  653.730170
562   1563       Gambia  2002   1457766.0    58.041         NaN

[563 rows x 6 columns]

`os.chdir("/home/vik/Documents/code-py/")` -> Used to change directory, if you want to access a file in a different directory.

In [4]:
sheet1 = pd.read_excel(data_dir + "/gapminder_full.xlsx", sheet_name="data1")

# Find signature
# ?pd.read_excel
sheet1

     index      country  year  population  life exp     gdp_cap
0     1001  Afghanistan  1952   8425333.0    28.801  779.445314
1     1002  Afghanistan  1957   9240934.0       NaN  820.853030
2     1003  Afghanistan  1962  10267083.0    31.997  853.100710
3     1004  Afghanistan  1967  11537966.0    34.020  836.197138
4     1005  Afghanistan  1972  13079460.0    36.088  739.981106
..     ...          ...   ...         ...       ...         ...
558   1559       Gambia  1982    715523.0    45.580  835.809611
559   1560       Gambia  1987    848406.0    49.265  611.658861
560   1561       Gambia  1992   1025384.0    52.644  665.624413
561   1562       Gambia  1997   1235767.0    55.861  653.730170
562   1563       Gambia  2002   1457766.0    58.041         NaN

[563 rows x 6 columns]

In [5]:
mapping_df = pd.read_csv(data_dir + "/mapping.csv")
mapping_df

           country:continent
0           Afghanistan:Asia
1             Albania:Europe
2             Algeria:Africa
3              Angola:Africa
4         Argentina:Americas
..                       ...
137             Vietnam:Asia
138  West Bank and Gaza:Asia
139         Yemen, Rep.:Asia
140            Zambia:Africa
141          Zimbabwe:Africa

[142 rows x 1 columns]

In [6]:
df.head() # default arg: n=5

   index      country  year  population  life exp     gdp_cap
0   1001  Afghanistan  1952   8425333.0    28.801  779.445314
1   1002  Afghanistan  1957   9240934.0       NaN  820.853030
2   1003  Afghanistan  1962  10267083.0    31.997  853.100710
3   1004  Afghanistan  1967  11537966.0    34.020  836.197138
4   1005  Afghanistan  1972  13079460.0    36.088  739.981106

In [7]:
sheet1_des = sheet1.describe()

In [8]:
sheet1.columns

Index(['index', 'country', 'year', 'population', 'life exp', 'gdp_cap'], dtype='object')

In [9]:
sheet1.index

RangeIndex(start=0, stop=563, step=1)

In [10]:
sheet1.count()

index         563
country       563
year          563
population    554
life exp      560
gdp_cap       561
dtype: int64

In [11]:
len(sheet1)

563

In [12]:
# sheet1.set_index("index", inplace=True)

In [13]:
sheet1.head()

   index      country  year  population  life exp     gdp_cap
0   1001  Afghanistan  1952   8425333.0    28.801  779.445314
1   1002  Afghanistan  1957   9240934.0       NaN  820.853030
2   1003  Afghanistan  1962  10267083.0    31.997  853.100710
3   1004  Afghanistan  1967  11537966.0    34.020  836.197138
4   1005  Afghanistan  1972  13079460.0    36.088  739.981106

In [14]:
sheet1 = pd.read_excel(data_dir + "/gapminder_full.xlsx", sheet_name=0, index_col=0)
# This method is more clear.
sheet2 = pd.read_excel(data_dir + "/gapminder_full.xlsx", sheet_name="data2", index_col="index")
sheet2.head()

       country  year  population  life exp       gdp_cap
index
1564    Gambia  2007         NaN       NaN    752.749726
1565   Germany  1952  69145952.0      67.5   7144.114393
1566   Germany  1957  71019069.0      69.1  10187.826650
1567   Germany  1962  73739117.0      70.3  12902.462910
1568   Germany  1967  76368453.0      70.8  14745.625610

In [15]:
pd.read_csv("./data/mapping.csv")

           country:continent
0           Afghanistan:Asia
1             Albania:Europe
2             Algeria:Africa
3              Angola:Africa
4         Argentina:Americas
..                       ...
137             Vietnam:Asia
138  West Bank and Gaza:Asia
139         Yemen, Rep.:Asia
140            Zambia:Africa
141          Zimbabwe:Africa

[142 rows x 1 columns]

In [16]:
sheet1["population"]

index
1001     8425333.0
1002     9240934.0
1003    10267083.0
1004    11537966.0
1005    13079460.0
           ...
1559      715523.0
1560      848406.0
1561     1025384.0
1562     1235767.0
1563     1457766.0
Name: population, Length: 563, dtype: float64

In [17]:
sheet1.columns

Index(['country', 'year', 'population', 'life exp', 'gdp_cap'], dtype='object')

In [18]:
year_gdp = sheet1[["year", "gdp_cap"]]

In [19]:
# year_gdp.to_clipboard()

In [20]:
# sheet1.set_index("index", inplace=True)

In [21]:
sheet1.loc[1005, "country"]

'Afghanistan'

We can specify multiple indeices we want, as well as the specific column names by using lists instead.

In [22]:
sheet1.loc[[1005, 1045], ["country", "life exp", "gdp_cap"]]

           country  life exp      gdp_cap
index
1005   Afghanistan    36.088   739.981106
1045        Angola    40.647  2627.845685

Using a colon instead gets us the entire range of values specified.

In [23]:
sheet1.loc[1005:1010, "country":"gdp_cap"]

           country  year  population  life exp     gdp_cap
index
1005   Afghanistan  1972  13079460.0    36.088  739.981106
1006   Afghanistan  1977  14880372.0    38.438  786.113360
1007   Afghanistan  1982         NaN    39.854  978.011439
1008   Afghanistan  1987  13867957.0    40.822  852.395945
1009   Afghanistan  1992  16317921.0    41.674  649.341395
1010   Afghanistan  1997  22227415.0    41.763  635.341351

In [24]:
sheet1.loc[(sheet1["gdp_cap"] > 30000) & (sheet1["country"] == "Australia")]
# sheet1.info()

         country  year  population  life exp      gdp_cap
index
1071   Australia  2002  19546792.0    80.370  30687.75473
1072   Australia  2007  20434176.0    81.235  34435.36744

Let's say we want to skip population column.

In [25]:
# sheet1.columns != "population"  # [True, True, False, True, True]

sheet1.loc[1500:1505, sheet1.columns != "population"]

        country  year  life exp     gdp_cap
index
1500    Eritrea  1987    46.453  521.134133
1501    Eritrea  1992    49.991  582.858510
1502    Eritrea  1997    53.378  913.470790
1503    Eritrea  2002    55.240  765.350001
1504    Eritrea  2007    58.040  641.369524
1505   Ethiopia  1952    34.078  362.146280

In [26]:
sheet1.loc[1100:1105, ~ sheet1.columns.isin(["population", "year"])]

          country  life exp     gdp_cap
index
1100   Bangladesh    43.453  721.186086
1101   Bangladesh    45.252  630.233627
1102   Bangladesh    46.923  659.877232
1103   Bangladesh    50.009  676.981866
1104   Bangladesh    52.819  751.979403
1105   Bangladesh    56.018  837.810164

In [27]:
combined = sheet1.append(sheet2)
# combined

`axis=0` stack (concat) data with similar columns, it can add new columns

`axis=1` stack (concat) data with similar rows, it can add new rows

In [28]:
new_combined = pd.concat([sheet1, sheet2], axis=0)
new_combined.head()

           country  year  population  life exp     gdp_cap
index
1001   Afghanistan  1952   8425333.0    28.801  779.445314
1002   Afghanistan  1957   9240934.0       NaN  820.853030
1003   Afghanistan  1962  10267083.0    31.997  853.100710
1004   Afghanistan  1967  11537966.0    34.020  836.197138
1005   Afghanistan  1972  13079460.0    36.088  739.981106

In [41]:
# new_combined.reset_index() # reset index
new_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1704 entries, 1001 to 2704
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1669 non-null   float64
 3   life exp    1687 non-null   float64
 4   gdp_cap     1699 non-null   float64
dtypes: float64(3), int64(1), object(1)
memory usage: 79.9+ KB

Format = `lambda input : output`

In [30]:
muli_add = lambda x, y, z: x * y + z
print(muli_add(5, 8, 2))

(lambda x: x**2)(5)

42

25

In [31]:
l_func = lambda y, fun1, fun2: y + fun1(y) + fun2(y)
l_func(3, lambda x: x**4, lambda x: x**2)

93

In [35]:
test_arr = [12, 13, 14]
list(map(lambda x: x**2, test_arr))

country_test = ["India:Asia", "Japan:Asia", "Germany:Europe"]
list(map(lambda val: val.split(":")[0], country_test))

['India', 'Japan', 'Germany']

In [36]:
test_num_arr = [1, -5, 6, -10]
list(filter(lambda x: x > 0, test_num_arr))

[1, 6]

In [59]:
mapping_df["country"] = mapping_df.iloc[:, 0].map(lambda val: val.split(":")[0])
# mapping_df["continent"] = mapping_df["country:continent"].map(lambda val: val.split(":")[1])

# Two ways to delete columns
# del mapping_df["country:continent"]
# mapping_df.drop(mapping_df.columns[0], inplace=True)
mapping_df.head()
# mapping_df.columns

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3       Angola    Africa
4    Argentina  Americas

In [60]:
# merged_df = pd.merge(new_combined, mapping_df, on="country", how="left")
# OR
merged_df = new_combined.merge(mapping_df, on="country", how="left")

In [62]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1669 non-null   float64
 3   life exp    1687 non-null   float64
 4   gdp_cap     1699 non-null   float64
 5   continent   1704 non-null   object
dtypes: float64(3), int64(1), object(2)
memory usage: 93.2+ KB